In [16]:
import numpy as np
import pandas as pd
import seaborn as sns
from pandas.api.types import CategoricalDtype

In [11]:
titanic= sns.load_dataset('titanic')
df = titanic.copy()
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [25]:
num=df.select_dtypes(include=["float64","int64"])
num

     survived  pclass   age  sibsp  parch     fare
0           0       3  22.0      1      0   7.2500
1           1       1  38.0      1      0  71.2833
2           1       3  26.0      0      0   7.9250
3           1       1  35.0      1      0  53.1000
4           0       3  35.0      0      0   8.0500
..        ...     ...   ...    ...    ...      ...
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

In [27]:
df.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [ ]:
# verilerin normal dagilimi olup olmadigini mean ve ortanca nin biribirine yaklinligi ile iliskilidir.Eger birbirine yakinsa normal dagilim
# deilse normal dagilim deildir diye bir cikarim yapabiliriz.yukardaki verilerde age in normal dagilim oldugunu soyleyebiiriz.

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    category
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    category
 8   class        891 non-null    category
 9   who          891 non-null    category
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    category
 13  alive        891 non-null    category
 14  alone        891 non-null    bool
dtypes: bool(2), category(7), float64(2), int64(4)
memory usage: 50.7 KB

In [31]:
df.who = df.who.astype(CategoricalDtype(ordered=False))
df.embarked = df.embarked.astype(CategoricalDtype(ordered=False))
df.embark_town = df.embark_town.astype(CategoricalDtype(ordered=False))
df.alive = df.alive.astype(CategoricalDtype(ordered=False))
df.deck = df.deck.astype(CategoricalDtype(ordered=False))
df.sex = df.sex.astype(CategoricalDtype(ordered=False))

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    category
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    category
 8   class        891 non-null    category
 9   who          891 non-null    category
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    category
 13  alive        891 non-null    category
 14  alone        891 non-null    bool
dtypes: bool(2), category(7), float64(2), int64(4)
memory usage: 50.7 KB

In [37]:
df["class"].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [39]:
df["class"] = df["class"].astype(CategoricalDtype(ordered=True))

In [40]:
df["class"].head()

0    Third
1    First
2    Third
3    First
4    Third
Name: class, dtype: category
Categories (3, object): ['First' < 'Second' < 'Third']

In [41]:
class_categori=["Third","Second","First"]
df["class"] = df["class"].astype(CategoricalDtype(categories=class_categori,ordered=True))
df["class"].head()

0    Third
1    First
2    Third
3    First
4    Third
Name: class, dtype: category
Categories (3, object): ['Third' < 'Second' < 'First']

In [42]:
from sklearn.preprocessing import LabelEncoder
Le=LabelEncoder()

In [45]:
df.sex=Le.fit_transform(df.sex)
df.sex.value_counts()

1    577
0    314
Name: sex, dtype: int64

In [46]:
df["class"]=Le.fit_transform(df["class"])
df["class"].value_counts()

2    491
0    216
1    184
Name: class, dtype: int64

In [47]:
dumm_sex=pd.get_dummies(df.sex)
dumm_sex

     0  1
0    0  1
1    1  0
2    1  0
3    1  0
4    0  1
..  .. ..
886  0  1
887  1  0
888  1  0
889  0  1
890  0  1

[891 rows x 2 columns]

In [48]:
dumm_class=pd.get_dummies(df["class"])
dumm_class

     0  1  2
0    0  0  1
1    1  0  0
2    0  0  1
3    1  0  0
4    0  0  1
..  .. .. ..
886  0  1  0
887  1  0  0
888  0  0  1
889  1  0  0
890  0  0  1

[891 rows x 3 columns]

In [49]:
df.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
sex       891.0   0.647587   0.477990  0.00   0.0000   1.0000   1.0    1.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292
class     891.0   1.308642   0.836071  0.00   1.0000   2.0000   2.0    2.0000

In [57]:
from scipy.stats import normaltest
from scipy.stats import shapiro
from statsmodels.stats.proportion import proportions_ztest

In [54]:
test_value,p_value=normaltest(df.age)
p_value

nan

In [55]:
test_value,p_value=normaltest(df.fare)
p_value
#fare verisi normal testi 0.5 in altinda oldugndan normal dagilim deldir diyebiliriz.

3.727091062842147e-197

In [ ]:
# H0 hipotezi Titanik kazasÄ±nda insanlarin sosyo ekonomik siniflari hayatta kalma oranlarÄ±na herhangi bir etkisi yoktur
# H1 hipotezi Titanik kazasÄ±nda insanlarin sosyo ekonomik siniflari hayatta kalma oranlarÄ±na herhangi bir etkisi vardÄ±r.

In [58]:
df["alive"]=Le.fit_transform(df["alive"])

In [61]:
A=df["class"]
B=df["alive"]
A_B = pd.concat([A, B], axis = 1)
A_B.columns = ["A","B"]

A_B.head()

   A  B
0  2  0
1  0  1
2  2  1
3  0  1
4  2  0

In [72]:
A=df["class"]
B=df["alive"]
#A ve A'nÄ±n grubu
GRUP_A = np.arange(len(A))
GRUP_A = pd.DataFrame(GRUP_A)
GRUP_A[:] = "A"
A = pd.concat([A, GRUP_A], axis = 1)

#B ve B'nin Grubu
GRUP_B = np.arange(len(B))
GRUP_B = pd.DataFrame(GRUP_B)
GRUP_B[:] = "B"
B = pd.concat([B, GRUP_B], axis = 1)

#Tum veri
AB = pd.concat([A,B])

AB.head()

   class  0  alive
0    2.0  A    NaN
1    0.0  A    NaN
2    2.0  A    NaN
3    0.0  A    NaN
4    2.0  A    NaN

In [71]:
AB.tail()

     class  0  alive
886    NaN  B    0.0
887    NaN  B    1.0
888    NaN  B    0.0
889    NaN  B    1.0
890    NaN  B    0.0

In [75]:
shapiro(A_B.A)

ShapiroResult(statistic=0.7183380126953125, pvalue=3.3958725291830076e-36)

In [76]:
shapiro(A_B.B)

ShapiroResult(statistic=0.616659939289093, pvalue=1.7945308393836472e-40)

In [78]:
import scipy.stats as stats
stats.levene(A_B.A, A_B.B)

LeveneResult(statistic=90.04223321250018, pvalue=7.189908883210466e-21)

In [79]:
stats.ttest_ind(A_B["A"], A_B["B"], equal_var = True)

Ttest_indResult(statistic=28.536439017031256, pvalue=8.30528434602907e-148)

In [80]:
test_istatistigi, pvalue = stats.ttest_ind(A_B["A"], A_B["B"], equal_var=True)
print('Test Ä°statistiÄŸi = %.4f, p-deÄŸeri = %.4f' % (test_istatistigi, pvalue))

Test Ä°statistiÄŸi = 28.5364, p-deÄŸeri = 0.0000

In [81]:
stats.mannwhitneyu(A_B["A"], A_B["B"])

MannwhitneyuResult(statistic=164628.0, pvalue=3.97364723330772e-116)

In [82]:
print('Test Ä°statistiÄŸi = %.4f, p-deÄŸeri = %.4f' % (test_istatistigi, pvalue))

Test Ä°statistiÄŸi = 28.5364, p-deÄŸeri = 0.0000

In [ ]:
# H0 hipotezi Titanik kazasÄ±nda insanlarin sosyo ekonomik siniflari hayatta kalma oranlarÄ±na herhangi bir etkisi yoktur
# H1 hipotezi Titanik kazasÄ±nda insanlarin sosyo ekonomik siniflari hayatta kalma oranlarÄ±na herhangi bir etkisi vardÄ±r.
#Yukaridaki testlerin sonuclarina bakarsak p degerinin 0.5 in altinda olmasindan dolayi h0 hipotezini yanlis oldugunu soyleyebiliriz.
# yani Titanik kazasÄ±nda insanlarin sosyo ekonomik siniflari hayatta kalma oranlarÄ±na herhangi bir etkisi vardÄ±r.H1 hipotezi dogrudur.